print("Решаем уровнение ax**2 + bx + c = 0")
a = float(input("Введите число a: "))
b = float(input("Введите число b: "))
c = float(input("Введите число c: "))
print(f"{a}x**2 + {b}x + {c} = 0")

print("_______________")
d = b**2 - 4 * a * c
if d > 0:
    print(f"Дискриминант больше чем 0. Он равен {d}. У него может быть два корня")
    result1 = d ** 0.5
    result2 = -1 * b - result1
    result3 = -1 * b + result1
    x1 = result2 / (2 * a)
    x2 = result3 / (2 * a)
    print("_______________")
    print(f"x1 равен = {x1}")
    print(f"x2 равен = {x2}")
elif d == 0:
    print(f"Дискриминант равен 0. У него может быть только корень")
    x = -1 * (b / (2 * a))
    print("_______________")
    print(f"x равен = {x}")
else:
    print(f"Дискриминант ниже чем 0. Он равен {d}. У него не может быть корней")

